section_1/perf/results/sleep/gunicorn_load_output.txt
> artillery "run" "./scenarios/sleep_load.yaml" "-e" "gunicorn"

Started phase 0 (Plain), duration: 20s @ 22:49:17(-0300) 2020-11-10
Report @ 22:49:27(-0300) 2020-11-10
Elapsed time: 10 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Report @ 22:49:37(-0300) 2020-11-10
Elapsed time: 20 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Started phase 1 (Ramp Up 1), duration: 10s @ 22:49:37(-0300) 2020-11-10
Report @ 22:49:47(-0300) 2020-11-10
Elapsed time: 30 seconds
  Scenarios launched:  48
  Scenarios completed: 2
  Requests completed:  2
  Mean response/sec: 5.71
  Response time (msec):
    min: 3013.1
    max: 5779.4
    median: 4396.2
    p95: 5779.4
    p99: 5779.4
  Codes:
    200: 2

Started phase 2 (Ramp Up 2), duration: 10s @ 22:49:48(-0300) 2020-11-10
Report @ 22:49:57(-0300) 2020-11-10
Elapsed time: 40 seconds
  Scenarios launched:  136
  Scenarios completed: 4
  Requests completed:  4
  Mean response/sec: 13.61
  Response time (msec):
    min: 8095.8
    max: 15907
    median: 11899.4
    p95: 15907
    p99: 15907
  Codes:
    200: 4

Started phase 3 (Ramp Up 3), duration: 10s @ 22:49:58(-0300) 2020-11-10
Report @ 22:50:07(-0300) 2020-11-10
Elapsed time: 50 seconds
  Scenarios launched:  231
  Scenarios completed: 3
  Requests completed:  3
  Mean response/sec: 23.14
  Response time (msec):
    min: 18712.1
    max: 24522.8
    median: 21613.7
    p95: 24522.8
    p99: 24522.8
  Codes:
    200: 3

Started phase 4 (Ramp Up 4), duration: 10s @ 22:50:09(-0300) 2020-11-10
Report @ 22:50:17(-0300) 2020-11-10
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  334
  Scenarios completed: 3
  Requests completed:  3
  Mean response/sec: 33.5
  Response time (msec):
    min: 27423.9
    max: 33028
    median: 30229.8
    p95: 33028
    p99: 33028
  Codes:
    200: 3
  Errors:
    ECONNRESET: 226

Started phase 5 (Ramp Up 5), duration: 10s @ 22:50:19(-0300) 2020-11-10
Report @ 22:50:27(-0300) 2020-11-10
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  434
  Scenarios completed: 4
  Requests completed:  4
  Mean response/sec: 43.44
  Response time (msec):
    min: 35936.3
    max: 44049.4
    median: 40095.3
    p95: 44049.4
    p99: 44049.4
  Codes:
    200: 4
  Errors:
    ECONNRESET: 430

Started phase 6 (Ramp Up 6), duration: 10s @ 22:50:29(-0300) 2020-11-10
Report @ 22:50:37(-0300) 2020-11-10
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  535
  Scenarios completed: 3
  Requests completed:  3
  Mean response/sec: 53.45
  Response time (msec):
    min: 46757.7
    max: 52563.2
    median: 49660
    p95: 52563.2
    p99: 52563.2
  Codes:
    200: 3
  Errors:
    ECONNRESET: 531

Started phase 7 (Ramp Up 7), duration: 10s @ 22:50:39(-0300) 2020-11-10
Report @ 22:50:47(-0300) 2020-11-10
Elapsed time: 1 minute, 30 seconds
  Scenarios launched:  632
  Scenarios completed: 29
  Requests completed:  29
  Mean response/sec: 63.36
  Response time (msec):
    min: 55370.5
    max: 60028.2
    median: 60000.4
    p95: 60003.7
    p99: 60028.2
  Codes:
    200: 2
    504: 27
  Errors:
    ECONNRESET: 604

Started phase 8 (Ramp Up 8), duration: 10s @ 22:50:49(-0300) 2020-11-10
Report @ 22:50:57(-0300) 2020-11-10
Elapsed time: 1 minute, 40 seconds
  Scenarios launched:  726
  Scenarios completed: 136
  Requests completed:  136
  Mean response/sec: 72.6
  Response time (msec):
    min: 59998.6
    max: 60034.5
    median: 60003.6
    p95: 60007
    p99: 60014.5
  Codes:
    504: 136
  Errors:
    ECONNRESET: 590

Started phase 9 (Ramp Up 9), duration: 10s @ 22:50:59(-0300) 2020-11-10
Report @ 22:51:07(-0300) 2020-11-10
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  818
  Scenarios completed: 230
  Requests completed:  230
  Mean response/sec: 81.8
  Response time (msec):
    min: 59998.6
    max: 60039.6
    median: 60001.9
    p95: 60004.9
    p99: 60009.5
  Codes:
    504: 230
  Errors:
    ECONNRESET: 588

Started phase 10 (Ramp Up 10), duration: 10s @ 22:51:09(-0300) 2020-11-10
Report @ 22:51:17(-0300) 2020-11-10
Elapsed time: 2 minutes, 0 seconds
  Scenarios launched:  939
  Scenarios completed: 109
  Requests completed:  109
  Mean response/sec: 94.08
  Response time (msec):
    min: 59998.6
    max: 60025.7
    median: 60002
    p95: 60005.4
    p99: 60020.9
  Codes:
    504: 109
  Errors:
    ECONNRESET: 829

Started phase 11 (Ramp Up 11), duration: 10s @ 22:51:19(-0300) 2020-11-10
Report @ 22:51:27(-0300) 2020-11-10
Elapsed time: 2 minutes, 10 seconds
  Scenarios launched:  1037
  Scenarios completed: 4
  Requests completed:  4
  Mean response/sec: 103.9
  Response time (msec):
    min: 59999
    max: 60007.8
    median: 60002.6
    p95: 60007.8
    p99: 60007.8
  Codes:
    504: 4
  Errors:
    ECONNRESET: 1033

Started phase 12 (Ramp Up 12), duration: 10s @ 22:51:29(-0300) 2020-11-10
Report @ 22:51:37(-0300) 2020-11-10
Elapsed time: 2 minutes, 20 seconds
  Scenarios launched:  1119
  Scenarios completed: 3
  Requests completed:  3
  Mean response/sec: 112.01
  Response time (msec):
    min: 60003.7
    max: 60008.8
    median: 60006.5
    p95: 60008.8
    p99: 60008.8
  Codes:
    504: 3
  Errors:
    ECONNRESET: 1116

Started phase 13 (Ramp Up 13), duration: 10s @ 22:51:39(-0300) 2020-11-10
Report @ 22:51:47(-0300) 2020-11-10
Elapsed time: 2 minutes, 30 seconds
  Scenarios launched:  1231
  Scenarios completed: 29
  Requests completed:  29
  Mean response/sec: 123.22
  Response time (msec):
    min: 60002.1
    max: 60008.5
    median: 60005
    p95: 60007.3
    p99: 60008.5
  Codes:
    504: 29
  Errors:
    ECONNRESET: 1203

Started phase 14 (Ramp Up 14), duration: 10s @ 22:51:49(-0300) 2020-11-10
Report @ 22:51:57(-0300) 2020-11-10
Elapsed time: 2 minutes, 40 seconds
  Scenarios launched:  1322
  Scenarios completed: 136
  Requests completed:  136
  Mean response/sec: 132.33
  Response time (msec):
    min: 59997.2
    max: 60010.9
    median: 60001.5
    p95: 60004.4
    p99: 60009.3
  Codes:
    504: 136
  Errors:
    ECONNRESET: 1186

Started phase 15 (Ramp Up 15), duration: 10s @ 22:51:59(-0300) 2020-11-10
Report @ 22:52:07(-0300) 2020-11-10
Elapsed time: 2 minutes, 50 seconds
  Scenarios launched:  1412
  Scenarios completed: 230
  Requests completed:  230
  Mean response/sec: 141.2
  Response time (msec):
    min: 59997.6
    max: 60020.2
    median: 60002.5
    p95: 60007.2
    p99: 60016.4
  Codes:
    504: 230
  Errors:
    ECONNRESET: 1182

Started phase 16 (Ramp Up 16), duration: 10s @ 22:52:09(-0300) 2020-11-10
Report @ 22:52:17(-0300) 2020-11-10
Elapsed time: 3 minutes, 0 seconds
  Scenarios launched:  1533
  Scenarios completed: 109
  Requests completed:  109
  Mean response/sec: 153.45
  Response time (msec):
    min: 60002.1
    max: 60012.4
    median: 60005
    p95: 60009.2
    p99: 60011.8
  Codes:
    504: 109
  Errors:
    ECONNRESET: 1423

Started phase 17 (Ramp Up 17), duration: 10s @ 22:52:20(-0300) 2020-11-10
Report @ 22:52:27(-0300) 2020-11-10
Elapsed time: 3 minutes, 10 seconds
  Scenarios launched:  1622
  Scenarios completed: 4
  Requests completed:  4
  Mean response/sec: 162.36
  Response time (msec):
    min: 60002.9
    max: 60005.6
    median: 60004.3
    p95: 60005.6
    p99: 60005.6
  Codes:
    504: 4
  Errors:
    ECONNRESET: 1619

Started phase 18 (Ramp Up 18), duration: 10s @ 22:52:30(-0300) 2020-11-10
Report @ 22:52:37(-0300) 2020-11-10
Elapsed time: 3 minutes, 20 seconds
  Scenarios launched:  1711
  Scenarios completed: 3
  Requests completed:  3
  Mean response/sec: 171
  Response time (msec):
    min: 59997.9
    max: 60003.4
    median: 60003.3
    p95: 60003.4
    p99: 60003.4
  Codes:
    504: 3
  Errors:
    ECONNRESET: 1707

Started phase 19 (Ramp Up 19), duration: 10s @ 22:52:40(-0300) 2020-11-10
Report @ 22:52:47(-0300) 2020-11-10
Elapsed time: 3 minutes, 30 seconds
  Scenarios launched:  1824
  Scenarios completed: 29
  Requests completed:  29
  Mean response/sec: 182.4
  Response time (msec):
    min: 59999.7
    max: 60009.7
    median: 60001.9
    p95: 60006.5
    p99: 60009.7
  Codes:
    504: 29
  Errors:
    ECONNRESET: 1794

Started phase 20 (Ramp Up 20), duration: 10s @ 22:52:50(-0300) 2020-11-10
Report @ 22:52:57(-0300) 2020-11-10
Elapsed time: 3 minutes, 40 seconds
  Scenarios launched:  1872
  Scenarios completed: 136
  Requests completed:  136
  Mean response/sec: 187.3
  Response time (msec):
    min: 59998.3
    max: 60013.6
    median: 60004.2
    p95: 60008.7
    p99: 60011.8
  Codes:
    504: 136
  Errors:
    ECONNRESET: 1738

Started phase 21 (Plain), duration: 20s @ 22:53:00(-0300) 2020-11-10
Report @ 22:53:07(-0300) 2020-11-10
Elapsed time: 3 minutes, 50 seconds
  Scenarios launched:  535
  Scenarios completed: 230
  Requests completed:  230
  Mean response/sec: 53.55
  Response time (msec):
    min: 59998.1
    max: 60016.8
    median: 60004.9
    p95: 60009.9
    p99: 60012.3
  Codes:
    504: 230
  Errors:
    ECONNRESET: 483

Report @ 22:53:17(-0300) 2020-11-10
Elapsed time: 4 minutes, 0 seconds
  Scenarios launched:  0
  Scenarios completed: 109
  Requests completed:  109
  Mean response/sec: NaN
  Response time (msec):
    min: 59998.2
    max: 60015.9
    median: 60001.9
    p95: 60006.5
    p99: 60013.3
  Codes:
    504: 109

Report @ 22:53:27(-0300) 2020-11-10
Elapsed time: 4 minutes, 10 seconds
  Scenarios launched:  0
  Scenarios completed: 4
  Requests completed:  4
  Mean response/sec: NaN
  Response time (msec):
    min: 60003.2
    max: 60006.8
    median: 60004.7
    p95: 60006.8
    p99: 60006.8
  Codes:
    504: 4

Report @ 22:53:37(-0300) 2020-11-10
Elapsed time: 4 minutes, 20 seconds
  Scenarios launched:  0
  Scenarios completed: 3
  Requests completed:  3
  Mean response/sec: NaN
  Response time (msec):
    min: 60005.1
    max: 60006.9
    median: 60005.4
    p95: 60006.9
    p99: 60006.9
  Codes:
    504: 3

Report @ 22:53:47(-0300) 2020-11-10
Elapsed time: 4 minutes, 30 seconds
  Scenarios launched:  0
  Scenarios completed: 29
  Requests completed:  29
  Mean response/sec: NaN
  Response time (msec):
    min: 59998.9
    max: 60010.3
    median: 60004.8
    p95: 60009.8
    p99: 60010.3
  Codes:
    504: 29

Report @ 22:53:57(-0300) 2020-11-10
Elapsed time: 4 minutes, 40 seconds
  Scenarios launched:  0
  Scenarios completed: 136
  Requests completed:  136
  Mean response/sec: NaN
  Response time (msec):
    min: 59996.5
    max: 61039.1
    median: 60002.8
    p95: 61030.7
    p99: 61038.8
  Codes:
    504: 136

Report @ 22:54:01(-0300) 2020-11-10
Elapsed time: 4 minutes, 43 seconds
  Scenarios launched:  0
  Scenarios completed: 52
  Requests completed:  52
  Mean response/sec: NaN
  Response time (msec):
    min: 59998.8
    max: 61026.9
    median: 60002.6
    p95: 60011.2
    p99: 61026.7
  Codes:
    504: 52

All virtual users finished
Summary report @ 22:54:01(-0300) 2020-11-10
  Scenarios launched:  20051
  Scenarios completed: 1769
  Requests completed:  1769
  Mean response/sec: 76.48
  Response time (msec):
    min: 3013.1
    max: 61039.1
    median: 60002.8
    p95: 60008.4
    p99: 61008.8
  Scenario counts:
    Sleep (/sleep): 20051 (100%)
  Codes:
    200: 21
    504: 1748
  Errors:
    ECONNRESET: 18282